In [72]:
import pandas as pd 
import numpy as np

In [73]:
import warnings
warnings.filterwarnings("ignore")

In [74]:
df = pd.read_csv("ft_(Price).csv")
df

   Price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [75]:
df.shape

(9, 1)

In [76]:
x = df.copy()
x

   Price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

# NORMALIZATION

In [77]:
x.min()

Price    100
dtype: int64

In [78]:
x.max()

Price    150
dtype: int64

In [79]:
normalized = (x-x.min()) / (x.max()-x.min())
normalized

   Price
0    0.2
1    0.1
2    0.3
3    0.4
4    0.2
5    0.6
6    1.0
7    0.0
8    0.1

# STANDARDIZATION

In [80]:
x1= df.copy()
x1

   Price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [81]:
x1.mean()

Price    116.111111
dtype: float64

In [82]:
x1.std()

Price    15.567951
dtype: float64

In [83]:
x1.size

9

In [84]:
standardized = (x1 - x1.mean()) / x1.std()
standardized

      Price
0 -0.392544
1 -0.713717
2 -0.071372
3  0.249801
4 -0.392544
5  0.892146
6  2.176837
7 -1.034890
8 -0.713717

# LOG TRANSFORMATION

In [85]:
x2 = df.copy()
x2

   Price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [86]:
log_transformed = np.log10(x2)
log_transformed

      Price
0  2.041393
1  2.021189
2  2.060698
3  2.079181
4  2.041393
5  2.113943
6  2.176091
7  2.000000
8  2.021189

# MAX ABSOLUTE SCALER

In [87]:
x3 = df.copy()
x3

   Price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [88]:
max_abs = np.max(np.abs(x3))
max_abs

Price    150
dtype: int64

In [89]:
mav = (x3 / max_abs)
mav

      Price
0  0.733333
1  0.700000
2  0.766667
3  0.800000
4  0.733333
5  0.866667
6  1.000000
7  0.666667
8  0.700000

# ROBUST SCALER

In [90]:
x4 = df.copy()
x4

   Price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [91]:
a = np.percentile(x4, 75)
a

120.0

In [92]:
b = np.percentile(x4, 25)
b

105.0

In [93]:
iqr = a - b
iqr

15.0

In [94]:
x4.median()

Price    110.0
dtype: float64

In [95]:
rs = (x4-x4.median()) / iqr
rs

      Price
0  0.000000
1 -0.333333
2  0.333333
3  0.666667
4  0.000000
5  1.333333
6  2.666667
7 -0.666667
8 -0.333333